Revit 2017 API
BasePoint.IsShared Property
Indicates whether the base point is shared.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public bool IsShared { get; }
Visual Basic
Public ReadOnly Property IsShared As Boolean
	Get
Visual C++
public:
property bool IsShared {
	bool get ();
}
See Also
BasePoint Class
Autodesk.Revit.DB Namespace